import { TextDocContent } from "@/types/TextDocTypes";

export interface DefinitionType {
    title: string;

    content: { title: string; text: string }[];
}

interface OfertaDocType {
    title: string;
    description: string;
    definitions: DefinitionType;
    data: TextDocContent[];
}

export const ofertaData: OfertaDocType = {
    title: "Публічний договір <purple>(оферта)</purple> на замовлення послуг Проєкту <purple>“i love my team”</purple>",
    description:
        "Цей документ, положення якого викладені нижче по тексту, є публічним договором. Згідно з положеннями статей 633, 641 Цивільного кодексу України умови публічного договору (оферти) є однаковими для всіх Замовників послуг  Проєкту “i love my team”.",
    definitions: {
        title: "Визначення термінів",
        content: [
            {
                title: "Оферта (Договір)",
                text: "цей документ, адресований всім фізичним та юридичним особам, що бажають скористатися послугами Проєкту “i love my team”, розміщений на сайті *site* за посиланням: *oferta*.",
            },
            {
                title: "Договір",
                text: "договір про надання послуг, укладений між Виконавцем та Замовником в момент Акцепту Замовником даного Договору.",
            },
            {
                title: "Сайт",
                text: "вебсайт Виконавця *site*.",
            },
            {
                title: "Виконавець",
                text: "фізична особа підприємець Салата Іван Григорович, що здійснює свою діяльність під комерційним найменуванням Проєкт “i love my team”.",
            },
            {
                title: "Замовник послуг",
                text: "будь-яка дієздатна фізична особа, яка досягла 18 років, юридична особа або фізична особа-підприємець, що ознайомилася з умовами даного Договору та вчинила Акцепт.",
            },
            {
                title: "Акцепт",
                text: "повне та безумовне прийняття Замовником умов даного Договору, що свідчить про укладення Договору. Акцептом вважається вчинення однієї з таких дій: оплата Рахунку, виставленого Виконавцем; здійснення часткової або повної передоплати за Послуги;  письмове (в тому числі надіслане на електронну пошту - *email*) підтвердження Замовником згоди на отримання Послуг на умовах, викладених у комерційній пропозиції Виконавця;  заповнення онлайн-форми “Замовити” на Сайті Виконавця з проставленням відмітки про згоду з умови даного Договору.",
            },
            {
                title: "Послуги Проєкту “i love my team”",
                text: "інформаційно-консультаційні послуги щодо розробки цифрових продуктів, а також окремі або комплексні послуги з аналізу бізнесу та конкурентів, дизайну, розробки, тестування та технічної підтримки цифрових продуктів, описані на сайті за посиланням: *services*.",
            },
            {
                title: "Рахунок (інвойс)",
                text: "розрахунковий документ, що надається Виконавцем Замовнику для оплати Послуг, який містить реквізити Виконавця та інформацію про замовника, перелік конкретних Послуг, їх вартість, терміни оплати та може містити строки надання Послуг.",
            },
            {
                title: "Технічне Завдання (ТЗ",
                text: "документ, що може бути складений у формі Додатка до Договору, який детально описує вимоги, етапи, функціонал, терміни виконання та інші характеристики Послуг.",
            },
            {
                title: "Бриф",
                text: "це документ, що є обов’язковим додатком до Договору, в якому описуються особливості бізнесу Замовника, портрет аудиторії, очікування Замовника та технічні можливості сайту, вимоги до оформлення, бюджет та терміни виконання.",
            },
            {
                title: "Політика конфіденційності та захисту даних",
                text: " документ, що визначає умови пов'язані зі збиранням, обробкою, використанням та зберіганням  персональних даних замовників послуг, учасників Проєкту “I love my team” та відвідувачів сайту *site*. Політика конфіденційності та захисту даних Проєкту “I love my team” розміщена за посиланням:  *policy*, і є невід'ємною частиною Договору.",
            },
            {
                title: "Сторони",
                text: "спільне найменування Виконавця і Замовника.",
            },
        ],
    },
    data: [
        {
            title: "<purple>Предмет</purple> \nдоговору",
            content: [
                {
                    type: "text",
                    text: "1.1. Виконавець зобов'язується надати Замовнику  інформаційно-консультаційні та/або послуги з розробки цифрових продуктів, а Замовник зобов'язується прийняти та оплатити такі Послуги на умовах даного Договору.",
                },
                {
                    type: "text",
                    text: "1.2.  Найменування Послуг, одиниці виміру, кількість, ціна за одиницю послуги, штрафні санкції, спосіб визначення ціни Договору та етапи виконання Послуг, що надаються на умовах цього Договору, узгоджуються Сторонами та фіксуються у Брифі або Технічному Завданні , що є невід'ємною частиною цього Договору.",
                },
                {
                    type: "text",
                    text: "1.3. Виконавець гарантує дотримання авторського права, суміжних прав чи інших прав третіх осіб під час виконання своїх зобов'язань за Договором.",
                },
            ],
        },
        {
            title: "<purple>Ціна</purple> Договору та порядок <purple>розрахунків</purple>",
            content: [
                {
                    type: "text",
                    text: "2.1. Ціна Договору  складається із сумарної вартості наданих Послуг Замовнику впродовж  строку дії Договору.",
                },
                {
                    type: "text",
                    text: "2.2. Ціна за Послуги вказується в інвойсі в національній валюті України та включає усі прямі витрати Виконавця, пов'язані з виконанням його зобов'язань за Договором, в тому числі витрати  на сплату податків та інших зборів і обов'язкових платежів, що сплачуються або мають бути сплачені Виконавцем.",
                },

                {
                    type: "text",
                    text: "2.2.1 Для Замовників, які не є резидентами України та не мають рахунків в українському банку і не мають можливості оплатити в національній валюті ціна за Послуги може бути встановлена в  іноземній валюті – євро (EUR) або доларі США (USD).",
                },
                {
                    type: "text",
                    text: "2.3 Усі банківські комісії та інші збори, що стягуються банком Замовника (як резидента, так і нерезидента), а також банками-кореспондентами (у випадку здійснення міжнародних платежів Замовником-нерезидентом), пов'язані з переказом коштів, сплачуються Замовником у повному обсязі.",
                },
                {
                    type: "text",
                    text: "2.4. Виконавець несе відповідальність лише за сплату комісій свого банку в Україні, пов'язаних із зарахуванням отриманих коштів. Сума, що має бути зарахована на рахунок Виконавця, повинна відповідати повній сумі, зазначеній у Рахунку (Інвойсі).",
                },
                {
                    type: "text",
                    text: "2.5. Спосіб визначення ціни Договору за моделями: фіксована ціна (Fixed Price), або погодинна ставка (Time & Materials), або за етапами робіт (Milestone) визначається та узгоджується Сторонами у Брифі та Технічному Завданні, або  у відповідному  Інвойсі, що є невід'ємними Додатками до Договору. ",
                },
                {
                    type: "text",
                    text: "2.6. Розрахунок за Послуги здійснюється  в безготівковій формі на умовах, визначених у пунктах 2.6.1-2.6.3 Договору шляхом перерахування грошових коштів на відповідні розрахункові рахунки Виконавця, вказані в Інвойсі.",
                },
                {
                    type: "text",
                    text: "2.6.1 Розрахунок за Послуги, що надаються Виконавцем за фіксованою ціною (Fixed Price) здійснюються Замовником за передоплатою у розмірі 50%  ціни Договору та 50% після повного надання послуг або в розмірі 100% післяоплати на підставі виставленого Виконавцем Інвойсу  впродовж 3  (трьох) робочих днів.",
                },
                {
                    type: "text",
                    text: "2.6.2. Розрахунок за Послуги, що надаються Виконавцем за погодинною ставкою (Time & Materials)  здійснюється Замовником двічі на місяць, виходячи з кількості фактично витрачених годин роботи спеціалістів Виконавця та погодинних ставок, узгоджених Сторонами у Технічному Завданні на підставі  відповідного Інвойсу, що надається Замовнику разом зі звітом про витрачений час із зазначенням виконаних завдань, впродовж 3  (трьох) робочих днів  від дати надсилання Інвойсу.",
                },
                {
                    type: "text",
                    text: "2.6.3. Розрахунок за Послуги, що надаються Виконавцем за етапами робіт (Milestone) здійснюється Замовником за 100% передоплатою за перший етап, та за кожний наступний етап після повного завершення та приймання робіт за попереднім етапом на підставі виставлених Виконавцем Інвойсів впродовж 3 (трьох) робочих днів від дати Інвойсу. ",
                },
                {
                    type: "text",
                    text: "2.7. Ціна Договору може бути збільшена у разі, якщо  в процесі надання Послуг за моделлю Fixed Price або Milestone виникає потреба у виконанні робіт, що виходять за межі початково узгодженого обсягу, визначеного у Брифі та Технічному Завданні.  Вартість, строки та порядок їх надання  узгоджуються Сторонами додатково. Такі зміни оформлюються у вигляді окремого Додатка до Договору та сплачуються Замовником на підставі окремого Інвойса.",
                },
                {
                    type: "text",
                    text: "2.8. Здійснена Замовником оплата Послуг за Інвойсом Виконавця підтверджує безумовне прийняття наданих Послуг  в повному обсязі.",
                },
                {
                    type: "text",
                    text: "2.9. Зобов'язання Замовника щодо оплати Послуг за цим Договором вважається виконаним у момент зарахування коштів на рахунок Виконавця.",
                },
            ],
        },
        {
            title: "<purple>Строки</purple> та <purple>порядок</purple> \nнадання послуг",
            content: [
                {
                    type: "text",
                    text: "3.1. Строк надання Послуг визначається за домовленістю Сторін у Брифі або Технічному Завданні, що є невід'ємним додатком до цього Договору. ",
                },
                {
                    type: "text",
                    text: "3.2. Послуги надаються Виконавцем дистанційно.",
                },
                {
                    type: "text",
                    text: "3.3. По завершенню надання Послуг Виконавець надсилає Замовнику електронною поштою або іншими офіційними засобами телекомунікаційного зв’язку, визначеними у пункті 9.6 Договору, Інвойс із вказаними термінами оплати  та документацію, обумовлену Сторонами у Брифі або Технічному Завданні. Замовник, зобов'язаний протягом 10 (десяти)  робочих днів здійснити оплату по фінальному Інвойсу, таким чином підтвердивши прийняття робіт у повному обсягу, або у цей же строк надати мотивовану відмову, вказавши причини такої відмови.",
                },
                {
                    type: "text",
                    text: "3.4. Обов'язок оформлення фінальному Інвойсу та документації, обумовленої Сторонами у Брифі або Технічному завданні покладається на Виконавця.",
                },
                {
                    type: "text",
                    text: "3.5. Датою прийняття наданих Послуг в повному обсязі є дата надсилання оплати по Інвойсу з терміном оплати 10 (десять) днів.",
                },
                {
                    type: "text",
                    text: "3.6. У разі ненадходження до Виконавця мотивованої відмови у строк, встановлений пунктом 3.3 Договору, Послуги вважаються наданими у повному обсязі від дати оплати фінального Інвойсу.",
                },
                {
                    type: "text",
                    text: "3.7. Сторони погодили, що даний Договір, Додатки до нього та Додаткові угоди, а також документи, пов'язані з його виконанням  можуть укладатися Сторонами у вигляді електронного документа із застосуванням кваліфікованого електронного підпису. Такі документи, направлені один одному засобами телекомунікаційного зв’язку або на електронних носіях, вважаються оригіналами.",
                },
                {
                    type: "text",
                    text: "3.8. Електронний документ вважається укладеним Сторонами та підписаним з обох Сторін у дату, зазначену в тексті такого електронного документа. ",
                },
                {
                    type: "text",
                    text: '3.9. Використання Сторонами електронного документообігу та засобів телекомунікаційного зв’язку здійснюється відповідно до Законів України «Про електронні документи та електронний документообіг» та «Про електронну ідентифікацію та електронні довірчі послуги» , а також "Про електронну комерцію".',
                },
            ],
        },
        {
            title: "<purple>Права</purple> та \n<purple>обов'язки</purple> сторін",
            content: [
                { type: "text", text: "4.1. Замовник зобов’язаний:" },
                {
                    type: "text",
                    text: "4.1.1. Своєчасно та в повному обсязі сплачувати вартість Послуг згідно з виставленими Інвойсами;",
                },

                {
                    type: "text",
                    text: "4.1.2. Приймати надані Послуги згідно з умовами за цим Договором або відмовитись, надіславши мотивовану відмову у встановлений за цим Договором термін;",
                },
                {
                    type: "text",
                    text: "4.1.3. За запитом Виконавця надавати йому в оговорений термін інформацію, необхідну для надання послуг за цим Договором;",
                },
                {
                    type: "text",
                    text: "4.1.4. Взаємодіяти самому, або призначити особу відповідальну за взаємодію зі спеціалістами Виконавця для надання Виконавцем послуг за цим Договором;",
                },
                {
                    type: "text",
                    text: "4.1.5. На вимогу Виконавця письмово погоджувати та затверджувати запропоновані Замовником зміни до Технічного завдання.",
                },
                { type: "text", text: "4.2. Замовник має право:" },
                {
                    type: "text",
                    text: "4.2.1. Вимагати від Виконавця надання послуг у строки, встановлені цим Договором, та в обсязі, погодженому Сторонами.",
                },
                {
                    type: "text",
                    text: "4.2.2. Збільшувати  або зменшувати обсяг замовлених послуг. У такому випадку, Замовник зобов’язаний письмово повідомити Виконавця про збільшення або зменшення обсягу послуг не менше ніж за 30 робочих днів до дати введення таких змін обсягу Договору.",
                },
                {
                    type: "text",
                    text: "4.2.3.  Відмовитися від послуг Виконавця до закінчення строку дії Договору, повідомивши про це Виконавця письмово через офіційні канали комунікації не пізніше, ніж за 30 (тридцять) робочих  днів, та здійснивши з ним розрахунки за фактично надані послуги + оплата за наступні 30 робочих днів в розрахунку, як за попередній аналогічний період (Time & Materials) або наступний етап робіт (Milestone) відповідно до умов даного Договору, зазначених у пунктах 2.6.2. та 2.6.3.",
                },
                { type: "text", text: "4.3. Виконавець зобов’язаний:" },
                {
                    type: "text",
                    text: "4.3.1. Надати послуги якісно та у строки, встановлені цим Договором;",
                },
                {
                    type: "text",
                    text: "4.3.2. Не використовувати за межами виконання умов договору, не передавати  і не розголошувати отриману від Замовника інформацію, яка має конфіденційний характер та складає комерційну таємницю. Не передавати таку інформацію, яка стала відома внаслідок виконання Сторонами положень Договору, будь-яким третім особам і не використовувати створену документацію у своїй діяльності та у відносинах з третіми особами, не пов'язаними з виконанням цього Договору без письмового погодження із Замовником;",
                },
                { type: "text", text: "4.4. Виконавець має право:" },
                {
                    type: "text",
                    text: "4.4.1. Своєчасно та в повному обсязі отримувати плату за надані послуги в порядку, визначеному цим Договором;",
                },
                {
                    type: "text",
                    text: "4.4.2. У разі невиконання Замовником зобов'язань щодо оплати наданих Послуг, достроково розірвати Договір, повідомивши про це Замовника за 30 (тридцять) робочих днів до дати розірвання Договору.",
                },
            ],
        },
        {
            title: "<purple>Права</purple> інтелектуальної \nвласності",
            content: [
                {
                    type: "text",
                    text: "5.1. Всі виключні майнові права інтелектуальної власності на об'єкти права інтелектуальної власності, створені Виконавцем під час надання Послуг за цим Договором  переходять до Замовника у тому числі право на використання, відтворення, розповсюдження, публічну демонстрацію, адаптацію та інші дії, передбачені ст. 427 ЦК України. ",
                },
                {
                    type: "text",
                    text: "5.2. Момент переходу майнових прав інтелектуальної власності від Виконавця до Замовника настає після  повної оплати Послуг за цим Договором.",
                },
                {
                    type: "text",
                    text: "5.3. Обсяг прав, що передаються відповідно до визначених об'єктів інтелектуальної власності,  узгоджується і фіксуються Сторонами в додатковій угоді до Договору.",
                },
                {
                    type: "text",
                    text: "5.4. Виконавець зберігає право використовувати, створені ним об'єкти інтелектуальної власності, в тому числі користуватися немайновими правами інтелектуальної власності, зокрема, у своєму Портфоліо, за умови дотримання законодавства у сфері інтелектуальної власності, та якщо це не порушує конфіденційність. ",
                },
            ],
        },
        {
            title: "<purple>Відповідальність</purple> Сторін та порядок <purple>вирішення</purple> спорів",
            content: [
                {
                    type: "text",
                    text: "6.1. У разі невиконання або неналежного виконання своїх зобов’язань за Договором, Сторони несуть відповідальність, передбачену чинним законодавством України та цим Договором.",
                },
                {
                    type: "text",
                    text: "6.2. У разі невиконання або несвоєчасного виконання своїх зобов'язань, Сторони  несуть відповідальність у вигляді штрафних санкцій (неустойка, штраф, пеня) у розмірі та на умовах, визначених у Брифі або Технічному завданні, що є невід'ємним додатком до Договору. Відсутність таких санкцій у додатках не знімає відповідальності згідно з ЦКУ. У разі їх відсутності застосовуються норми ст. 611 ЦК України.",
                },

                {
                    type: "text",
                    text: "6.3. Усі спори, що пов’язані із цим Договором, або такі, що виникають в процесі виконання умов цього Договору, вирішуються шляхом переговорів між представниками Сторін. Якщо спір неможливо вирішити шляхом переговорів, він вирішується у судовому порядку за рахунок позивача.",
                },
            ],
        },
        {
            title: "<purple>Обставини</purple> \nнепереборної сили",
            content: [
                {
                    type: "text",
                    text: "7.1. Сторони звільняються від відповідальності за невиконання або неналежне виконання зобов’язань за цим Договором у разі виникнення обставин непереборної сили, які не існували на момент прийняття Акцепту та виникли поза волею Сторін (аварія, катастрофа, стихійне лихо, епідемія, війна або її загострення на території країни Виконавця та пов'язані з цим ризики типу перебої з електропостачанням або зв’язком) і які Сторона об'єктивно не могла передбачити і запобігти, якщо ці обставини перешкоджають належному виконанню Стороною її зобов'язань за цим Договором.",
                },
                {
                    type: "text",
                    text: "7.2. Якщо на території за місцем розташування Замовника або Виконавця  розпочнеться ведення воєнних дій (активних бойових дій), які унеможливлюють виконання договірних зобов’язань Сторонами, такі обставини вважаються обставинами непереборної сили.",
                },
                {
                    type: "text",
                    text: "7.3. Сторона, що не може виконувати зобов’язання за цим Договором внаслідок дії обставин непереборної сили, повинна повідомити про це іншу Сторону у письмовій формі протягом 10 (десяти) календарних днів з дати їх виникнення.",
                },
                {
                    type: "text",
                    text: "7.4. Строки виконання зобов’язань Сторін за Договором можуть бути перенесені (продовжені) на строк, протягом якого діють обставини непереборної сили та їх наслідки.",
                },
                {
                    type: "text",
                    text: "7.5. У разі, коли строк дії обставин непереборної сили продовжується більше ніж 30 (тридцяти) календарних днів, а Сторони шляхом переговорів дійдуть висновку про неможливість подальшого виконання умов цього Договору, кожна зі Сторін має право розірвати цей Договір згідно з умовами , описаними у пункті 4.2.3.",
                },
                {
                    type: "text",
                    text: "7.6. Форс-мажор не звільняє від обов'язку оплатити вже надані послуги.",
                },
            ],
        },
        {
            title: "<purple>Строк</purple> \nдії договору",
            content: [
                {
                    type: "text",
                    text: "8.1 Договір вважається укладеним після виконання Замовником (Акцепту), однієї з таких дій:",
                },

                {
                    type: "text",
                    text: "здійснення часткової або повної передоплати за Послуги згідно з Інвойсом ;  ",
                },
                {
                    type: "text",
                    text: "письмове (в тому числі надіслане на електронну пошту - *email*) підтвердження Замовником згоди на отримання Послуг на умовах, викладених у комерційній пропозиції Виконавця;",
                },
                {
                    type: "text",
                    text: "заповнення онлайн-форми “Замовити” на Сайті Виконавця з проставленням відмітки про згоду з умовами даного Договору, та діє до повного виконання Сторонами своїх обов’язків за цим Договором.",
                },
                {
                    type: "text",
                    text: "8.2. Договір може бути достроково розірваний за взаємною письмовою згодою Сторін за умови виконання пункту  4.2.4 цього Договору. ",
                },
                {
                    type: "text",
                    text: "8.3. Закінчення строку дії договору не звільняє Сторони від відповідальності за його порушення, яке мало місце під час дії Договору.",
                },
            ],
        },
        {
            title: "<purple>Інші</purple> умови",
            content: [
                {
                    type: "text",
                    text: "9.1.  Даний Договір укладений при повному розумінні Сторонами його умов та термінології, українською мовою. Переклад тексту даного договору англійською та польською мовами розміщений на сайті за відповідними посиланнями *ofertaEN*  та *ofertaPL*.  У випадку виникнення будь-яких протиріч між україномовною версією Договору та версією, перекладеною на іншу мову, переважним є текст в україномовному варіанті.",
                },
                {
                    type: "text",
                    text: "9.2.  Усі додатки і доповнення до цього Договору, вчинені Сторонами під час його виконання, є його невід'ємною частиною і мають юридичну силу в разі, якщо вони викладені в письмовій формі, підписані Сторонами та скріплені печатками (у разі їх наявності).",
                },
                {
                    type: "text",
                    text: "9.3. Електронний обмін документами та повідомленнями в рамках цього Договору за електронними адресами, вказаними у цьому Договорі, вважається вчиненим сторонами в письмовій формі.",
                },
                {
                    type: "text",
                    text: "9.4. Сторони домовилися, що матеріали, інформація та відомості щодо даного Договору є конфіденційними та не можуть передаватися третім особам без попередньої письмової згоди на це іншої Сторони, крім випадків, якщо така передача пов’язана з вимогою компетентних органів,  документів для виконання Договору або сплати податків, інших обов’язкових платежів, а також у випадках, передбачених чинним законодавством України, що регулює зобов’язання Сторін Договору.",
                },
                {
                    type: "text",
                    text: "9.5. Сторони погоджують, що офіційними каналами зв'язку щодо виконання умов цього Договору є електронна пошта *email* та *emailSusanna*, і додатковими можуть вважатись інші електронні адреси та месенджери для комунікації в соціальних мережах із представниками Виконавця.",
                },
                {
                    type: "text",
                    text: "9.6. З метою дотримання положень законодавства про захист персональних даних Сторони, домовились, що  Складовою та невід’ємною частиною цього Договору є Політика конфіденційності та захисту даних Проєкту “і love my team” розміщена за посиланням:  *policy*.",
                },
                {
                    type: "text",
                    text: "9.7. Виконавець залишає за собою право змінювати або доповнювати умови даного Договору, розмістивши на цій сторінці відповідне повідомлення і нову редакцію Договору із зазначенням дати внесення останніх змін.",
                },
            ],
        },
    ],
};
