import { TextDocContent } from "@/types/TextDocTypes";
export interface PolicyType {
    ua: PolicyData;
    // en: PolicyData;
    // pl: PolicyData;
}

export interface PolicyData {
    title: string;
    publishDate: string;
    data: TextDocContent[];
}

export const policyData: PolicyType = {
    ua: {
        title: "Політика  <purple>конфіденційності</purple>",
        publishDate: "Від 06.06.2025",
        data: [
            {
                title: "Загальні \nположення",
                content: [
                    {
                        type: "text",
                        text: "Ця Політика конфіденційності (“Політика”) набирає чинності з дати публікації, зазначеної вище. ",
                    },
                    {
                        type: "text",
                        text: "Ця Політика застосовується до кожної особи, чиї персональні дані збираються через веб-сайт *site* (“Сайт”), та до інших осіб, які самостійно та добровільно залишають свої персональні дані на Сайті та які обробляються командою Сайту (“Суб'єкти даних”). Ця Політика описує, як Команда Сайту (“Ми”) збирає, обробляє, зберігає та використовуємо особисту інформацію, яку надають Відвідувачі Сайту.",
                    },
                    {
                        type: "text",
                        text: "Політика конфіденційності визначає, яким чином збираються, використовуються, обробляються та захищаються персональні дані, зібрані на нашому Сайті. Згідно політики ми прагнемо забезпечити конфіденційність, безпеку та захист особистої інформації Користувачів та Відвідувачів Сайту, які залишають свої дані на Сайті.",
                    },
                    {
                        type: "text",
                        text: "Ми не можемо контролювати працівників та підрядників, залучених нашими партнерами. Якщо ви відвідаєте інший сайт, посилання на який було розміщено на нашому Сайті, інша особа або організація може збирати та використовувати вашу особисту інформацію в інший спосіб, ніж описано в даній Політиці. Не забудьте перевірити їх Політику Конфіденційності, перш ніж приймати їх умови чи послуги.",
                    },
                    {
                        type: "text",
                        text: "Ми не можемо контролювати працівників та підрядників, залучених нашими партнерами. Якщо ви відвідаєте інший сайт, посилання на який було розміщено на нашому Сайті, інша особа або організація може збирати та використовувати вашу особисту інформацію в інший спосіб, ніж описано в даній Політиці. Не забудьте перевірити їх Політику Конфіденційності, перш ніж приймати їх умови чи послуги.",
                    },
                    {
                        type: "text",
                        text: "Запитання, коментарі та скарги щодо наших практик обробки даних можна надсилати за адресою *email*",
                    },
                ],
            },
            {
                title: "Дані, які \n<purple>ми збираємо</purple>",
                content: [
                    {
                        type: "text",
                        text: "Ми збираємо 3 категорії персональних даних: технічну інформацію про відвідувачів Сайту, інформацію про Учасників та інформація про потенційних Замовників.",
                    },
                    {
                        type: "subtitle",
                        text: "Інформація, яка може бути <purple>передана Команді</purple> під час відвідування вами нашого сайту:",
                    },
                    {
                        type: "list",
                        text: [
                            "ваша IP-адреса;",
                            "браузер, яким ви користуєтесь;",
                            "спосіб підключення до мережі;",
                            "мова, якою ви користуєтесь на сайті;",
                            "ідентифікатори пристрою.",
                        ],
                    },

                    {
                        type: "text",
                        text: "Ми використовуємо цю інформацію, щоб зробити функціональність нашого Сайту доступною для вас, дозволити вам використовувати сторонні послуги, покращити наш Сайт та відповісти на питання, які у вас можуть виникнути в результаті використання Сайту.",
                    },
                    {
                        type: "subtitle",
                        text: "Інформація, яку ми можемо попросити вас надати, якщо ви хочете стати:",
                    },
                    {
                        type: "subtitle",
                        text: "А) <purple>Учасником</purple> (для приєднання до Команди):",
                    },
                    {
                        type: "list",
                        text: [
                            "коонтактні дані (ім'я, прізвище, інші ідентифікатори, що використовуються в месенджерах та соціальних мережах, адресу електронної пошти, посилання на портфоліо та виконані вами проекти);",
                            "особисті дані (інформація про освіту, досвід роботи, дані про компанію де працюєте та/або дані ФОП);",
                            "дані для профілю Учасника (фото, цитати, стеки та інструменти, якими володієте та перелік послуг, які надаєте та їх вартість).",
                        ],
                    },

                    {
                        type: "subtitle",
                        text: "Б) <purple>Замовником</purple> (при запиті на консультацію та замовленні проектних послуг):",
                    },
                    {
                        type: "list",
                        text: [
                            "контактні дані (ім'я, інші ідентифікатори, що використовуються в месенджерах та соціальних мережах, адресу електронної пошти).",
                        ],
                    },

                    {
                        type: "text",
                        text: "Ми розглядаємо інформацію як достовірні дані про вас, які ви надаєте самостійно та добровільно. Ми не перевіряємо їх достовірність самостійно.",
                    },
                    {
                        type: "text",
                        text: "Ми використовуємо надані вами дані для того, щоб ідентифікувати Вас та підтвердити Вашу особу, полегшити спілкування та швидко надати відповідь на запит з вашого боку та відповісти на запитання, які можуть виникати у Вас як у Відвідувача/Учасника/Замовника. ",
                    },
                    {
                        type: "text",
                        text: "Також ми можемо використовувати надані вами дані для аналітики відвідувань/звернень/замовлень, часу перебування на сайті, точки входу/виходу на/з Сайту та поліпшення досвіду користувачів, в також відправку інформаційних листів та/або маркетингових матеріалів тощо.",
                    },
                    {
                        type: "text",
                        text: "Ми не використовуємо автоматизовані пристрої або програмне забезпечення для прийняття рішень. Всі заявки та звернення обробляються учасниками Команди, які мають доступ до наданих вами даних.",
                    },
                ],
            },
            {
                title: "Як ми використовуємо \n<purple>особисті дані</purple>",
                content: [
                    {
                        type: "subtitle",
                        text: "Наші цілі та підстави збору даних",
                    },
                    {
                        type: "text",
                        text: "Ми збираємо персональні дані для надання користувачам послуг, виконання угод та забезпечення зручності взаємодії з нашим веб-сайтом.",
                    },
                    {
                        type: "text",
                        text: "Ми також використовуємо персональні дані для аналізу веб-трафіку, вдосконалення функціональності та персоналізації веб-сайту, забезпечення кращого досвіду користувача.",
                    },
                    {
                        type: "text",
                        text: "Ми можемо використовувати персональні дані для надсилання інформаційних листів, маркетингових акцій, сповіщень про оновлення інформації на Сайті.",
                    },
                    {
                        type: "subtitle",
                        text: "А) Дані, отримані від <purple>учасника</purple> можуть використовуватися для:",
                    },
                    {
                        type: "list",
                        text: [
                            "надання інформаційних послуг щодо просування особистого профілю Учасниками та його/її послуг;",
                            "здійснення діяльності платформи та її вдосконалення;",
                            "комунікації із Учасником щодо замовлень його/її послуг, оновлення даних профілю, та з інших питань в межах діяльності Сайту, надання зворотнього зв’язку у разі інших питань від Учасника.",
                            "попередження, запобігання або вжиття заходів проти незаконної діяльності та / або порушення умов користування Сайтом;",
                            "верифікація особи Учасника згідно поданої ним/нею інформації.",
                        ],
                    },
                    {
                        type: "subtitle",
                        text: "Б) Дані, отримані від <purple>замовника</purple> можуть використовуватися для:",
                    },
                    {
                        type: "list",
                        text: [
                            "надання інформаційних послуг, пов’язаних підбором команди та її учасників при замовленні послуг;",
                            "впровадження функціоналу платформи та її вдосконалення;",
                            "надсилання додаткової інформації про замовлення;",
                            "надсилання відповіді на запит інформації про послуги;",
                            "попередження, запобігання або вжиття заходів проти незаконної діяльності та / або порушення правил користування Сайтом.",
                        ],
                    },
                ],
            },
            {
                title: "Як ми використовуємо <purple>cookie</purple> та <purple>технології</purple> відстеження поведінки Відвідувачів Сайту",
                content: [
                    {
                        type: "text",
                        text: "Ми використовуємо кукі та подібні технології для збору і зберігання інформації про взаємодію користувача з веб-сайтом. Це допомагає нам відстежувати відвідування, збирати аналітичні дані та покращувати взаємодію з користувачем.",
                    },
                    {
                        type: "subtitle",
                        text: "Що таке <purple>cookies</purple>",
                    },
                    {
                        type: "text",
                        text: "Cookies — це невеликі текстові файли, які веб-сайт зберігає на вашому комп’ютері або мобільному пристрої. Файли cookies дозволяють веб-сайту «пам’ятати» ваші дії або дані протягом певного часу. Зазвичай вони використовуються для підтримки авторизованих сесій або налаштування персоналізованого інтерфейсу, розміру шрифтів, кольорових схем, мови сайту тощо, та взагалі забезпечують комфортніше перебування на сайті.",
                    },
                    {
                        type: "subtitle",
                        text: "Як ми <purple>використовуємо</purple> cookies ",
                    },
                    {
                        type: "text",
                        text: "Основною метою використання cookies на цьому веб-сайті є забезпечення роботи користувачів, надання якісних персоналізованих послуг та збереження інформації при роботі з цим веб-сайтом.",
                    },
                    {
                        type: "text",
                        text: "Цей веб-сайт крім власних cookies може зберігати й інші додаткові файли, через використання сторонніх сервісів.",
                    },
                    {
                        type: "list",
                        text: [
                            "Основні файли cookies використовуються для роботи з основними функціями веб-сайту, щоб і вас була можливість відвідувати Сайт, а також використовувати його функції.",
                            "Файли cookies для аналітики допомагають нам зрозуміти, як відвідувачі використовують наш веб-сайт і переміщуються по ньому, це дає змогу покращувати та адаптувати наш веб-сайт до потреб відвідувачів. Відмова від цих файлів cookies не дозволить нам збирати такі дані та покращувати Сайт відповідно до ваших потреб.",
                        ],
                    },

                    {
                        type: "subtitle",
                        text: "<purple>Дані</purple>, які ми можемо <purple>збирати</purple> через cookies",
                    },
                    {
                        type: "list",
                        text: [
                            "IP-адреса;",
                            "веб-браузер;",
                            "операційна система;",
                            "відстеження доменів, з яких відвідують веб-сайт;",
                            "активність на веб-сайті;",
                            "середній час відвідування;",
                            "відвідані сторінки;",
                            "сторінка входу на веб-сайт;",
                            "сторінка виходу з веб-сайту.",
                        ],
                    },

                    {
                        type: "subtitle",
                        text: "Як <purple>контролювати</purple> cookies",
                    },
                    {
                        type: "text",
                        text: "Ви можете дізнатися про файли cookies, перевіривши сховище cookies для кожної сторінки веб-сайту через браузер.",
                    },
                    {
                        type: "text",
                        text: "Використовуючи цей веб-сайт, ви надаєте згоду на застосування cookies. У разі небажання зберігати файли cookies, ви можете використовувати спеціальний анонімний режим браузера або вручну знищувати файли після відвідування Сайту. В такому разі при наступному відвідуванні веб-сайт не відображатиме інформацію про ваш попередній візит та налаштування.",
                    },
                ],
            },
            {
                title: "Обробка та розкриття <purple>персональної інформації</purple>",
                content: [
                    {
                        type: "text",
                        text: "Ми приділяємо велику увагу захисту персональних даних і застосовуємо відповідні технічні та організаційні заходи для забезпечення безпеки даних. Це включає в себе використання захищених з'єднань, системних паролів, контроль доступу та інших заходів безпеки.",
                    },
                    {
                        type: "text",
                        text: "Ми приймаємо всі необхідні заходи для захисту персональних даних від несанкціонованого доступу, втрати, викриття чи зміни. Це включає застосування файрволів, антивірусного програмного забезпечення, резервного копіювання даних та інших заходів безпеки.",
                    },
                    {
                        type: "text",
                        text: "Разом з тим, дані, які наші Користувачі надають при зверненні та заповненні форми Учасника, в тому числі Ім’я, Прізвище, електронна пошта, акаунти в соціальних мережах, месенджері будуть доступні на нашому веб-сайті після додавання картки Учасника на Сайт і будь-який Відвідувач нашого веб-сайту зможе ознайомитись з цими даними.",
                    },
                    {
                        type: "subtitle",
                        text: "Підстави для обробки <purple>персональних даних</purple>",
                    },

                    {
                        type: "text",
                        text: "Обробка персональних даних здійснюється з дотриманням вимог Загального регламенту про захист даних (GDPR), , Закону України “Про захист персональних даних”, Rozporządzenie o ochronie danych osobowych (RODO)  (надалі - Закон) щодо правових підстав для обробки. Закон дозволяє нам збирати та обробляти ваші персональні дані на законних підставах наступним чином:",
                    },
                    {
                        type: "subtitle",
                        text: "Обробка, необхідна для виконання наших зобов’язань",
                    },
                    {
                        type: "text",
                        text: "Закон, а також інші чинні нормативні акти, залежно від стосунків між вами та нашою компанією, можуть впливати на:",
                    },
                    {
                        type: "list",
                        text: [
                            "обсяг персональних даних, які ми збираємо;",
                            "способи, якими ми обробляємо ваші персональні дані;",
                            "нашу можливість зберігати конфіденційність ваших даних та уникати їх несанкціонованого розголошення;",
                            "тривалість запланованого зберігання, тощо.",
                        ],
                    },

                    {
                        type: "text",
                        text: "Якщо обробка є необхідною для захисту життєво важливих інтересів людей або державної політики, ми не можемо відмовити у наданні копій ваших персональних даних, які ми зібрали або до якої можемо мати доступ у межах функціональних можливостей Сайту, владі та правоохоронним органам у разі отримання їх законного рішення або вимоги.",
                    },
                    {
                        type: "text",
                        text: "Крім того, ми можемо бути зобов'язані надати зведену інформацію органам державної статистики або державним архівам.",
                    },
                    {
                        type: "subtitle",
                        text: "Інформація про <purple>вік</purple> користувачів Сайту",
                    },
                    {
                        type: "text",
                        text: "Заповнюючи форму Учасника або форму Замовника на Сайті ви підтверджуєте, що є особою, яка досягла щонайменше вісімнадцять (18) років. Ми не маємо змоги перевірити достовірність наданих вами даних, тому відповідальність за правдивість та достовірність інформації про ваш вік залишається на вас.",
                    },
                    {
                        type: "text",
                        text: "Ми передбачаємо, що Суб’єктам, які використовують наш Сайт та мають доступ до нього як Учасниками/Замовниками, виповнилося вісімнадцять (18) років і вони мають усі права укласти угоду з нам щодо отримання/надання Послуг, а також щодо збору та обробки персональних даних за згодою Суб’єктів для цілей, про які ми згадуємо в цій Політиці.",
                    },
                    {
                        type: "text",
                        text: "Якщо представникам Команди стане відома достовірна інформація про неправдиво надані дані Користувача або Замовника - ми залишаємо за собою право видалити дані про такого Користувача в односторонньому порядку з повідомленням Користувачу на пошту про видалення його/її даних.",
                    },
                    {
                        type: "subtitle",
                        text: "Ми <purple>не</purple> працюємо з <purple>неповнолітніми</purple>",
                    },
                    {
                        type: "text",
                        text: "Якщо вам стало достовірно відомо, що ми обробляємо персональні дані Користувача, якому не виповнилось вісімнадцять (18) років, будь ласка, повідомте нам на пошту *email*. ",
                    },
                    {
                        type: "text",
                        text: "Для використання Наших послуг, ви повинні досягти віку вісімнадцяти (18) років. Ми не надаємо послуги суб’єктам, які не досягли вищезазначеного віку. Як результат, ми не обробляємо їх персональні дані. Ми залишаємо за собою право застосовувати будь-які інструменти та методи для розкриття торгівлі людьми та експлуатації дітей та негайно повідомляти про такі випадки відповідним державним органам та правоохоронним органам, включаючи персональні дані, пов'язані з діяльністю, яка на наш розсуд є підозрілою і може викликати занепокоєння щодо зв’язку з діями, які порушують чинне законодавство згідно Закону.",
                    },
                ],
            },
            {
                title: "Зберігання та передача <purple>персональних даних</purple>",
                content: [
                    {
                        type: "text",
                        text: "Ми будемо зберігати та обробляти ваші персональні дані стільки часу, скільки потрібно для надання послуг Користувачам Сайту. Якщо наша співпраця припинилася, персональні дані не будуть зберігатися довше одного (1) року з моменту домовленості про припинення співпраці, висловленої письмово на електронну адресу *email*.",
                    },
                    {
                        type: "text",
                        text: "Після закінчення зазначеного періоду зберігання ми будемо видаляти ваші персональні дані, якщо їх зберігання не виправдано юридичним зобов’язанням або нашим законним інтересом зробити це (тобто, якщо ваш акаунт раніше був помічений або підозрювався в участі в шахрайських схемах, порушенні законодавства, тощо).",
                    },
                    {
                        type: "text",
                        text: "Ви також можете вимагати видалення вашого профайлу на Сайті та на внутрішніх ресурсах Сайту в будь-який час, відправивши письмовий обґрунтований запит на видалення ваших персональних даних електронною поштою на *email*",
                    },
                    {
                        type: "text",
                        text: "Виконуючи ваш запит, ми видалимо вашу картку Учасника з Сайту протягом тридцяти (30) днів.",
                    },
                    {
                        type: "text",
                        text: "Ми залишаємо за собою право не видалити ваші персональні дані до розв’язання конфліктної ситуації або вирішення спору (наприклад, у випадку підозри у зв’язку із злочинними організаціями або іншим порушенням чинного законодавства, наприклад, шахрайство, небезпечна поведінка, загроза безпеки, залякування чи переслідування тощо). Після вирішення або врегулювання позову, закінчення кримінального чи адміністративного провадження або якщо підозра невиправдана протягом одного (1) року, ми видалимо вашу особисту інформацію і повідомимо про це письмово на вказану вами електронну пошту, з якої ми отримали ваш запит.",
                    },
                    {
                        type: "subtitle",
                        text: "Державні органи, органи виконавчої влади, суди",
                    },
                    {
                        type: "text",
                        text: "Ми можемо бути юридично зобов’язані розкрити ваші персональні дані компетентному державному органу, виконавчому органу або суду, якщо ми отримаємо від них обов’язковий офіційний запит на таке розкриття даних.",
                    },
                    {
                        type: "subtitle",
                        text: "Ваша <purple>згода</purple> на розкриття персональних даних",
                    },
                    {
                        type: "text",
                        text: "Ми повідомимо вас про цілі та обсяг інформації, а також попросимо вашого дозволу на передачу ваших особистих даних третій стороні, не зазначеній у цій Політиці.",
                    },
                    {
                        type: "subtitle",
                        text: "Право на <purple>відкликання згоди</purple>",
                    },
                    {
                        type: "text",
                        text: "Закон залишає за вами право відкликати згоду на обробку ваших персональних даних.",
                    },
                    {
                        type: "text",
                        text: "Ви можете користуватися цим правом у будь-який час, коли побажаєте. Пам'ятайте, що відкликання згоди не означає, що обробка ваших даних, яка здійснювалася до моменту до відкликання згоди, вважається незаконною.",
                    },
                    {
                        type: "text",
                        text: "Ви можете відкликати свою згоду, надіславши нам офіційне електронне повідомлення на *email* із вказаними своїми особистими даними, які ви хочете прибрати або виправити на нашому Сайті та підтвердження особи, щоб ми могли вас ідентифікувати як власника цих персональних даних.",
                    },
                    {
                        type: "text",
                        text: "Перш ніж відкликати свою згоду на обробку даних, будь ласка, врахуйте, що це може як наслідок припинення подальшої співпраці.",
                    },
                    {
                        type: "text",
                        text: "Ми зробимо все можливе, щоб підтвердити Ваше відкликання згоди до 30-ти днів з моменту отримання Вашого запиту.",
                    },
                    {
                        type: "subtitle",
                        text: "Транскордонний <purple>обмін даними</purple>",
                    },
                    {
                        type: "text",
                        text: "Ми докладаємо всіх зусиль, щоб захистити ввірені дані від несанкціонованого доступу. Технічні заходи безпеки, регулярно переглядаються та адаптуються до технічного прогресу. Безпечна передача даних користувача за допомогою шифрування SSL, що забезпечує надійний захист даних.",
                    },
                    {
                        type: "text",
                        text: "Ми також можемо використовувати підтримку спеціалістів, кваліфікованих у виконанні завдань для вдосконалення наших послуг та веб-сайту, а також інших незалежних підрядників, наприклад, ІТ-спеціалістів, бухгалтерів, аудиторів, юристів тощо.",
                    },
                    {
                        type: "text",
                        text: "Для забезпечення належного рівня захисту ми застосували Стандартні типові положення, а також підписали Угоди про обробку даних у відносинах із залученими підрядниками, тому вони зобов’язані зберегти той рівень захисту персональних даних, який він надає згідно із законодавством.",
                    },
                ],
            },
            {
                title: "<purple>Права</purple> Користувачів \nСайту",
                content: [
                    {
                        type: "subtitle",
                        text: "Права Суб’єкта персональних даних <purple>згідно з Законом</purple>",
                    },
                    {
                        type: "text",
                        text: "Закон залишає за вами низку прав, якими ви можете користуватися для захисту персональних даних. Перелік прав, захищених Законом, такий:",
                    },
                    {
                        type: "list",
                        text: [
                            "право доступу (тобто ви можете попросити нас надіслати вам копію даних про вас, які ми зібрали);",
                            "право на виправлення (тобто ви можете попросити нас виправити застарілі або неправдиві дані, або заповнити дані, які відсутні або неповні);",
                            "право на видалення (тобто ви можете попросити нас видалити персональні дані, які ми зберігаємо, за умови, що Закон дозволяє це зробити);",
                            "право на обмеження обробки (якщо обробка може бути обмежена згідно з Законом);",
                            "право не надавати згоду на обробку (якщо Закон залишає право заперечувати щодо певних видів обробки або за певних обставин);",
                            "право на перенесення даних (тобто ви можете попросити нас передати копію ваших даних іншій організації або вам за умови, що обставини відповідають Закону).",
                        ],
                    },

                    {
                        type: "text",
                        text: "Ми дотримуємось вимог і норм, що стосуються конфіденційності і захисту персональних даних, встановлених чинним законодавством України.",
                    },
                    {
                        type: "text",
                        text: "Ми обробляємо персональні дані відповідно до законної підстави, такої як згода користувачів. Ми дотримуємося всіх правових обов'язків, пов'язаних з обробкою персональних даних, і забезпечуємо їх використання в межах встановлених правових рамок і дозволів користувачів.",
                    },
                    {
                        type: "text",
                        text: "У випадку, якщо ви вважаєте, що ми можемо порушувати чинні норми законодавства щодо збору, обробки і використання персональних даних ви завжди можете написати нам про це на електронну адресу *email*.",
                    },
                    {
                        type: "text",
                        text: "Надсилаючи запит на нашу пошту переконайтесь, що ваш запит містить деталі:",
                    },
                    {
                        type: "list",
                        text: [
                            "ваше ім’я;",
                            "контактна інформація;",
                            "право, яке ви хочете здійснити, і, де це зазначене;",
                            "ваші персональні дані в нашій обробці;",
                            "чітко сформульоване прохання виправити або видалити ваші дані;",
                            "причина / обґрунтування такого прохання.",
                        ],
                    },

                    {
                        type: "text",
                        text: "Ми можемо попросити вас надати нам додаткову інформацію, яку ми вже маємо, щоб підтвердити, що це ви або людина, яка є офіційним представником від вашого імені (за певних обставин)",
                    },
                ],
            },
            {
                title: "<purple>Оновлення</purple> Політики конфіденційності",
                content: [
                    {
                        type: "text",
                        text: "Ми залишаємо за собою право оновлювати цю Політику відповідно до змін Законодавства та змін на Сайті, пов’язаних із розширенням та вдосконаленням платформи взаємодії Користувачів та Команди Сайту.",
                    },
                    {
                        type: "text",
                        text: "Якщо ми внесемо суттєві зміни, ми повідомимо вас про зміни на нашому веб-сайті або іншими способами, наприклад електронною поштою, до того, як вони набудуть чинності. Ми закликаємо Вас періодично переглядати цю Політику, щоб отримати останню інформацію про оновлення.",
                    },
                    {
                        type: "text",
                        text: "Якщо в результаті цих змін ви хочете змінити режим використання нами ваших персональних даних, ви можете надіслати нам запит на електронну адресу *email*.",
                    },
                ],
            },
        ],
    },
};
